Repository: mozilla-l10n/mt-training-data
Catalog: am/am_pontoon.tmx
Source language: en_us
Languages: am

source: Open in %@
am: በ%@ ክፈት

source: Open in Chrome
am: በ Chrome ክፈት

source: Open in Default Browser
am: በነባሪ አሳሽ ክፈት

source: Open in Firefox
am: በ Firefox ክፈት

source: Open Link
am: አገናኙን ክፈት

source: Open Settings App
am: የቅንብሮች መተግበሪያን ይክፈቱ

source: Page Actions > Request Desktop Site
am: ገጽ ድርጊቶች > የዴስክቶፕ ድረ-ገፅ ጠይቅ

source: PRIVACY
am: ግላዊነት

source: Protection at your own discretion
am: ጥበቃ፤ በራስዎ ውሳኔ

source: Protections are OFF for this session
am: ለዚህ ክፍለ ጊዜ ጥበቃዎች ጠፍተዋል

source: Protections are ON for this session
am: ለዚህ ክፍለ ጊዜ ጥበቃዎች በርተዋል

source: %@ puts you in control.
am: %@ እርስዎን ውሣኔ ሰጪ ያደርግዎታል።

source: Quick Actions
am: ፈጣን እርምጃዎች

source: Rate %@
am: %@ን ደረጃ ስጥ

source: Read more about this and other updates to %@.
am: ስለዚህ እና ሌሎች የ%@ ዝማኔዎች የበለጠ ያንብቡ።

source: Rename Shortcut
am: አቋራጭን እንደገና ሰይም

source: Request Desktop Site
am: የዴስክቶፕ ድረ-ገፅን ጠይቅ

source: Request Mobile Site
am: የሞባይል ድረ-ገፅን ጠይቅ

source: Re-Record or Delete Shortcut
am: አቋራጭን እንደገና ይቅረጹ ወይም ይሰርዙ

source: Restore Default Search Engines
am: ነባሪ የፍለጋ ፍርግሞችን ወደነበረበት መልስ

source: Safari
am: ሳፋሪ

source: SAFARI INTEGRATION
am: SAFARI ውህደት

source: SEARCH
am: ፈልግ

source: Search and browse right in the app
am: በመተግበሪያው ውስጥ ይፈልጉ እና ያስሱ

source: Search Engine
am: የፍለጋ ፍርግም

source: Search for %@
am: ፈልግ ስለ %@

source: Search for %@. Then choose a widget.
am: %@ን ይፈልጉ። ከዚያ መግብር ይምረጡ።

source: Search in %@
am: በ%@ ውስጥ ይፈልጉ

source: Searching for something different? Choose a different search engine.
am: የሆነ የተለየ ነገር በመፈለግ ላይ ነዎት? ሌላ የፍለጋ-ፍርግም ይምረጡ።

source: Select Add to Shortcuts from the %@ menu
am: ከ%@ ምናሌ ውስጥ ወደ አቋራጮች አክል የሚለውን ይምረጡ

source: Select Location Bar
am: የአካባቢ አሞሌን ይምረጡ

source: Select Safari, then select Extensions
am: ሳፋሪን ይምረጡ፣ ከዚያ ቅጥያዎችን ይምረጡ

source: Set as Default Browser
am: ነባሪ አሳሽ አድርገህ አስቀምጥ

source: Set links from websites, emails and messages to open automatically in %@.
am: በ%@ ውስጥ በራስ ሰር የሚከፈቱ አገናኞችን ከድረ-ገፆች፣ ኢሜይሎች እና መልዕክቶች ያዘጋጁ።

source: Share Page With…
am: ገጽ አጋራ በ…

source: Shortcut removed
am: አቋራጭ ተወግዷል

source: Show home screen tips
am: የመነሻ ማያ ገጽ ምክሮችን አሳይ

source: Show Me How
am: እንዴት እንደሆነ አሳየኝ

source: Show Search Suggestions?
am: የፍለጋ ጥቆማዎችን አሳይ?

source: “Siri, erase my %@ session.”
am: "Siri፣ የእኔን %@ ክፍለ ጊዜ ደምስስ።"

source: “Siri, open my favorite site.”
am: "Siri፣ የእኔን ተወዳጅ ድረ-ገፅ ክፈት።"

source: SIRI SHORTCUTS
am: የSIRI አቋራጮች

source: Site missing content or acting strange?
am: ድረ-ገፁ ይዘቱ ተጓድሏል ወይስ እንግዳ ባህርይ አለው?

source: Start a private search in %@ with your default search engine.
am: በነባሪ የፍለጋ ፍርግምዎ በ%@ ውስጥ የግል ፍለጋ ይጀምሩ።

source: %@ stopped this site from spying on you. Tap the shield for info on what we blocked.
am: %@ ይህ ድረ-ገፅ እርስዎን እንዳይሰልል አቁሞታል። ያገድነውን በተመለከተ መረጃ ለማግኘት ጋሻውን ይንኩ።

source: System Theme
am: የስርዓት ገጽታ

source: Take your private browsing to the next level.
am: የግል አሰሳዎን ወደሚቀጥለው ደረጃ ይውሰዱት።

source: Tap on the plus icon.
am: የመደመር አዶውን ይንኩ።

source: Tap Safari, then select Content Blockers
am: ሳፋሪን ይንኩ እና የይዘት ማገጃዎችን ይምረጡ

source: Tap the trash anytime to remove all traces of your current session.
am: የአሁኑን ክፍለ ጊዜዎን ሁሉንም ዱካዎች ለማስወገድ በማንኛውም ጊዜ መጣያውን ነካ ያድርጉ።

source: That didn’t work. Try replacing the search term with this: %s.
am: ያ አልሰራም። የፍለጋ ቃሉን በዚህ ለመተካት ይሞክሩ፡- %s።

source: The Internet connection appears to be offline.
am: የበይነመረብ ግንኙነቱ የተቋረጠ ይመስላል።

source: Theme Picker
am: ገጽታ መራጭ

source: This helps us diagnose and fix issues with the browser.
am: ይህ በአሳሹ ላይ ችግሮችን እንድንመረምር እና እንድናስተካክል ይረዳናል።

source: This lets you save and upload photos.
am: ይሄ ፎቶዎችን እንዲያስቀምጡ እና እንዲጭኑ ያስችልዎታል።

source: This lets you take and upload photos.
am: ይህ ፎቶዎችን እንዲያነሱ እና ለመጫን ያስችልዎታል።

source: This lets you take and upload videos.
am: ይህ ተንቀሳቃሽ-ምሥሎችን እንዲያነሱ እና እንዲጭኑ ያስችልዎታል።

source: This lets you unlock the app.
am: ይሄ መተግበሪያውን እንዲከፍቱ ያስችልዎታል።

source: To get suggestions, %@ needs to send what you type in the address bar to the search engine.
am: ጥቆማዎችን ለማግኘት %@ በአድራሻ አሞሌው ላይ የሚተይቡትን ወደ ፍለጋ ፍርግም መላክ አለበት።

source: Top Sites
am: ከፍተኛ ድረ-ገፆች

source: Touch ID can unlock %@ if a URL is already open in the app
am: ዩአርኤል አስቀድሞ በመተግበሪያው ውስጥ ከተከፈተ፤ የንክኪ መታወቂያ %@ን መክፈት ይችላል

source: Trackers and scripts to block
am: መከታተያዎች እና ስክሪፕቶች ለማገድ

source: Trackers blocked since %@
am: ከ%@ ጀምሮ የታገዱ መከታተያዎች

source: %@ trackers blocked so far
am: %@ መከታተያዎች እስካሁን ታግደዋል

source: Tracking Protection
am: የክትትል ጥበቃ

source: Try turning off Tracking Protection
am: የክትትል ጥበቃን በማጥፋት ይሞክሩ

source: Turn on Face ID
am: የፊት መታወቂያን ያብሩ

source: Turn on Touch ID
am: የንክኪ መታወቂያን ያብሩ

source: URL Copied To Clipboard
am: URL ወደ ቅንጥብ ሰሌዳ ተቀድቷል

source: URL to open
am: የሚከፈተው URL

source: Use Face ID to unlock app
am: መተግበሪያን ለመክፈት የፊት መታወቂያን ይጠቀሙ

source: Use it as a private browser:
am: እንደ የግል አሳሽ ይጠቀሙበት፡-

source: Use it as a Safari extension:
am: እንደ ሳፋሪ ቅጥያ ይጠቀሙበት፡-

source: Use System Light/Dark Mode
am: የስርዓት ብርሃን/ጨለማ ሁነታን ተጠቀም

source: Use Touch ID to unlock app
am: መተግበሪያን ለመክፈት የንክኪ መታወቂያን ይጠቀሙ

source: %@ wants to open another App
am: %@ ሌላ መተግበሪያ መክፈት ይፈልጋል

source: Want to see the full desktop version of a site?
am: የድረ-ገፁን ሙሉ የዴስክቶፕ ስሪት ማየት ይፈልጋሉ?

source: Websites you visit may request your location.
am: የሚጎበኟቸው ድረ-ገፆች መገኛ ቦታዎን ሊጠይቁ ይችላሉ።

source: Welcome to %@
am: እንኳን ወደ %@ በደህና መጡ

source: Welcome to Firefox %@!
am: ወደ ፋየርፎክስ %@ እንኳን በደህና መጡ!

source: We’ll leave you to your private browsing, but get a quicker start next time with the %@ widget on your Home screen.
am: እርስዎን ከግል አሰሳዎ ጋር እንተውዎታለን፣ ነገር-ግን በሚቀጥለው ጊዜ በመነሻ ማያዎ ላይ ባለው %@ መግብር በፍጥነት ይጀምሩ።

source: Why yes, we do have a fresh new look!
am: ለምን አዎ፣ አዲስ መልክ አለን!

source: %@ will send what you type in the address bar to your search engine.
am: %@ በአድራሻ አሞሌው ላይ የሚተይቡትን ወደ የፍለጋ ፍርግምዎ ይልካል።

source: You browse. %@ blocks.
am: እርስዎ ያስሱ። %@ ያግዳል።

source: Your history doesn’t follow you
am: ታሪክዎ አይከተልዎትም

source: Your history is history
am: ታሪክዎ ታሪክ ነው

source: About Firefox and Mozilla
am: ስለ ፋየርፎክስ እና ሞዚላ

source: <a href="%(url)s">Chrome uses up to 1.77x more memory than Firefox</a>. If your computer is already low on memory, this can cause a significant slowdown. Using Firefox’s latest version with multi-process can result in more available memory to run your favorite programs.
am: <a href="%(url)s">ክሮም ከፋየርፎክስ በ 1.77 እጥፍ የበለጠ የማህደረ ትውስታ ቦታን ይጠቀማል</a>። ኮምፒውተርዎ ከመጀመሪያው አነስተኛ ማህደረ ትውስታ ካለው ደግሞ፤ ይኼ የበለጠ መዘግየቱን ይጨምራል። የቅርቡን ፋየርፎክስ ሲጠቀሙ ግን፤ የሚፈልጉትን ፕሮግራም ለማስኬድ በርካታ የማህደረ ትውስታ ቦታ ይኖርዎታል።

source: All Languages and Builds (incl. Win 64)
am: ሁሉም ቋንቋዎች እና ግንባታዎች (incl. Win 64)

source: Already have an account?
am: መታወቂያ(መለያ) አለዎት?

source: And be part of protecting the internet for future generations.
am: ለሚቀጥለዉ ትውልድ የኢንተርኔት ደህንነት የተጠበቀ እንዲሆን የራስዎን ድርሻ ይወጡ።

source: And get it all on every device, without feeling trapped in a single operating system.
am: እና በማንኛውም መገልገያ መሳሪያ፣ ሁሉንም አገልግሎቶች ያለምንም ስጋት በአንድ መከወኛ ላይ ያገኛሉ።

source: Android
am: አንድሮይድ

source: And start getting the respect you deserve with our family of privacy-first products.
am: ለደህንነት ቅድሚያ በሚሰጡት ምርቶቻችን በመጠቀም የሚገባዎትን ክብር ያግኙ።

source: At <a href="%(firefox)s">Firefox</a>, we’ve worked hard to build a browser that is twice as fast as before and gives users more control over their online life.
am: እኛ እንደ <a href="%(firefox)s">ፋየርፎክስ</a>፤ ጠንክረን እየሠራን ያለነው ከበፊቱ ሁለት እጥፍ ፈጣን የሆነና ተጠቃሚዎች ኢንተርኔትን በደንብ መቆጣጠር እንዲችሉ ለማድረግ ነው።

source: Automatic privacy is here. Download Firefox to block over 2000 trackers.
am: የራስ ሠር የደህንነት መጠበቂያ። ከ 2000 በላይ ሰርጎ ገቦችን ለማገድ ፋየርፎክስን ይጫኑ።

source: Be among the first to explore future releases of Firefox for desktop, Android and iOS.
am: በቅርቡ የሚለቀቅውን ፋየርፎክስ ለዴስክቶፕ፣ አንሮይድ እና ለ iOS ለመጠቀም ከመጀመርያዎቹ ሰዎች አንዱ ይሁኑ።

source: Better bookmarks
am: የተሻለ ዕልባት

source: Browse faster, privately
am: በፍጥነትና በግላዊነት ያስሱ

source: Browse freely with Firefox today.
am: ያለምንም ሀሳብ ኢንተርኔትን በፋየርፎክስ ይጠቀሙ።

source: Browser:
am: ድረ-ገፅ ማሰሻ:

source: Browse the Internet as it was meant to be… free, safe and accessible to all. Declare your online independence.
am: ኢንተርኔትን እንደሚባለው... በነፃ፣ በጥንቃቄ እና ለሁሉም ተደራሽ በሆነ ሁኔታ ይጠቀሙ። የኢንተርኔት ነፃነትዋን ያውጁ።

source: Choose a 32-bit installer for computers with 32-bit processors — or for older or less powerful computers. <a href="%(url)s">If you aren’t sure</a> whether to choose a 64-bit or 32-bit installer, we recommend you go with 32-bit.
am: ባለ 32-ቢት ማቀናጃን ለባለ 32-ቢት መከወኛ ኮምፒውተሮች - ወይም ለቀድሞዎቹ እና አነስተኛ አቅም ላላቸው ኮምፒውተሮች ይምረጡ። <a href="%(url)s">እርግጠኛ ካልሆኑ ግን</a> ባለ 64-ቢት ወይስ ባለ 32-ቢት ማቀናጃ እንደሚሻልዎት፤ ባለ 32-ቢት ቢጠቀሙ የተሻለ ነው።

source: Choose which Firefox Browser to download in your language
am: በራስዋ ቋንቋ ለመጫን የፈለጉትን አይነት የፋየርፎክስ ድረ-ገፅ ማሰሻ ይምረጡ

source: Connect to a whole family of respectful products, plus all the knowledge you need to protect yourself online.
am: አድናቆት የተቸራቸውን ሁሉንም አገልግሎቶች ይጠቀሙ እንዲሁም ኢንተርኔት ላይ እራስዎን የሚጠብቁበትን እውቀት ያግኙ።

source: Count on stability and ease of use with this Firefox browser built for enterprise.
am: ለድርጅቶች ታስቦ የተቀረፀው ፋየርፎክስ ድረ-ገፅ ማሰሻ፤ ወጥነት ያለው እና በቀላሉ መጠቀም የሚያስችል ነው።

source: Don’t agonize, lovers of bookmarking. Organize with Firefox.
am: ዕልባት ማድረግ ለሚመቻቸው አስቸጋሪ እናድርገው። በቀላሉ በፋየርፎክስ ያሰናዱ።

source: Download and test future releases of Firefox for desktop, Android and iOS.
am: ለወደፊት ለሚለቀቅው ፋየርፎክስ ለዴስክቶፕ ና አንሮይድ እና ለ iOS የሆነውን አውርድው ይሞክሩ

source: Download Firefox and get the Facebook Container Extension
am: ፋየርፎክስን ይጫኑና የፌስቡክ መያዣ ቅጥያን ይጠቀሙ

source: Download Mozilla Firefox, a free web browser. Firefox is created by a global non-profit dedicated to putting individuals in control online. Get Firefox for Windows, macOS, Linux, Android and iOS today!
am: ነፃ የድረ-ገፅ ማሰሻ የሆነውን፥ ሞዚላ ፋየርፎክስ ይጫኑ። ፋየርፎክስ የተፈጠረው ሁሉንም ሠዎች በኢንተርኔት ለማገናኘት ቀን ከሌት በሚጥሩ ለትርፍ ባልተቋቋሙ ድርጅቶች ነው። ፋየርፎክስን ለዊንዶስ፣ macOS፣ ሊኑክስ፣ አንድሮይድ እና iOS ዛሬውኑ ያግኙ!

source: Download Mozilla Firefox, a free Web browser. Firefox is created by a global non-profit dedicated to putting individuals in control online. Get Firefox for Windows, macOS, Linux, Android and iOS today!
am: ሞዚላ ፋየርፎክስን ይጫኑ፤ ነፃ ድረ-ገፅ ማሰሻ። ፋየርፎክስ የተፈጠረው በዓለም አቀፍ በጎ አድራጊዎች ሲሆን፤ አላማውም ሁሉም ግለሰቦች የኢንተርኔት አገልግሎትን በእጃቸው ቁጥጥር ስር እንዲያረጉ ማስቻል ነው፡፡ ለዊንዶስ፣ ለ macOS፣ ለሊኑክስ፣ ለአንድሮይድ እና ለ iOS ፋየርፎክስን ዛሬውኑ ያግኙ!

source: Download %(product_label)s for %(platform)s in %(locale)s
am: %(product_label)s ለ %(platform)s በ %(locale)s ጫን

source: Download the fastest Firefox ever
am: የምንጊዜውም ፈጣኑን ፋየርፎክስ ይጫኑ

source: Download the Firefox Browser in English (US) and more than 90 other languages
am: ፋየርፎክስ ድረ-ገፅ ማሰሻን በአማርኛ (am) አና በሌሎች 90 የተለያዩ ቋንቋዎች ይጫኑ

source: Easily organize your bookmarks into folder and access them across all your devices, from desktop to mobile.
am: ዕልባቶችን በቀላሉ በአቃፊ ውስጥ ለማደራጀት እና በሁሉም መገልገያ መሳሪያዎች ላይ፤ ከኮምፒውተር ወደ ሞባይል አድርገው መጠቀም ይችላሉ።

source: Enter your email address to get started.
am: ለመጀመር የኢሜል አድራሻ ያስገቡ።

source: Every computer program you run takes up some memory. When too much is used, your system can slooooowww down. Firefox aims for a balance — using enough memory to let you browse smoothly and leaving plenty of memory to keep your computer responsive.
am: ሁሉም የኮምፒውተር ፕሮግራሞች በሚሠሩበት ጊዜ የተወሰነ ማህደረ ትውስታ ቦታን ይጠቀማሉ። በጣም ብዙ ሲጠቀሙ ደግሞ የበለጠ ቀርፋፋ ይሆናል። ፋየርፎክስ ግን ሁለቱንም ያመጣጥናል - ኢንተርኔት ያለችግር እንዲጠቀሙ በቂ ቦታን ይይዛል፤ ኮምፒውተሩ በደንብ እንዲሠራ ደግሞ በርካታ የማህደረ ትውስታ ቦታን ይተዋል።

source: Everyone deserves access to the internet — your language should never be a barrier. That’s why — with the help of dedicated volunteers around the world — we make the Firefox Browser available in more than 90 languages.
am: ሁሉም ሰው የኢንተርኔት አገልግሎት ማግኘት ይገባዋል - ቋንቋ መሰናክል ሊሆን አይገባውም። ለዛ ነው - በአለም ዙሪያ ባሉ በጎ ፈቃደኛ ሰዎች እርዳታ - ፋየርፎክስ የድረ-ገፅ ማሰሻን በ90 የተለያዩ ቋንቋዎች ያቀረብነው።

source: Experience cutting-edge features in a pre-release browser for Android: Firefox Beta and Firefox Nightly. Install now!
am: ለአንሮይድ በቅድመ-የተለቀቀ አሳሽ ውስጥ ማራኪ ገጽታዎችን ይለማመዱ: ፋየርፎክስ ቤታ እና ፋየርፎክስ ናይትሊ :: አሁን ይጫኑ!

source: Experience cutting-edge features in a pre-release browser for Android: Firefox Beta, Firefox Aurora and Firefox Nightly. Install now!
am: ለአንሮይድ በቅድመ-የተለቀቀ አሳሽ ውስጥ ማራኪ ገጽታዎችን ይለማመዱ: ፋየርፎክስ ቤታ እና ፋየርፎክስ ኦሮራ እና ፋየርፎክስ ናይትሊ:: አሁን ይጫኑ!

source: Explore the web faster with <a href="%(url)s">Firefox Private Browsing</a>. Only Firefox’s private mode includes tracking protection which blocks ads with trackers from loading on pages. Decluttering sites means web pages can load faster.
am: ኢንተርኔትን በፍጥነት ይጠቀሙ <a href="%(url)s">ፋየርፎክስ የግላዊነት ማሰሻ</a>። በፋየርፎክስ የግላዊነት ዘዴ ብቻ ሰርጎ-ገቦች ማስታወቂያና ሌሎች ገፆችን እንዳይጭኑ መከላከል ይቻላል። የተበላሹ ድረ-ገፆች በፍጥነት ለመጫን ይችላሉ።

source: Facebook can track almost all your web activity and tie it to your Facebook identity. If that’s too much for you, the <a href="%(fbcontainer)s">Facebook Container extension</a> isolates your identity into a separate container tab, making it harder for Facebook to track you on the web outside of Facebook.
am: ፌስቡክ ሁሉንም የኢንተርኔት አጠቃቀምዎትን ሊከታተል ይችላል፤ ከዛም ከፌስቡክ ማንነትዎት ጋር ያስተሳስራቸዋል። ይኼ የሚያሳስብዎት ከሆነ፤ <a href="%(fbcontainer)s">የፌስቡክ መያዣ ቅጥያ</a> ማንነትዎን በሌላ ትር ለይቶ ያስቀምጣል፤ ይኼም ለፌስቡክ እርስዎን ለመከታተል አስቸጋሪ ያደርግበታል።

source: Facebook Container for Firefox | Prevent Facebook from seeing what websites you visit.
am: የፋየርፎክስ ፌስቡክ መያዣ | ፌስቡክ የምትፈልጉትን ድረ-ገፅ እንዳታዩ እንዳያረጋችሁ ይከላከላል።

source: Facebook. Well contained. Keep the rest of your life to yourself.
am: ፌስቡክ። በደንብ የተያዘ። ቀሪ ህይወትዎን ለራስዋ ብቻ ይስጡ።

source: Faster page loading, less memory usage and packed with features, the new Firefox is here.
am: በፍጥነት ድረ-ገፅ የሚጭን፣ አነስተኛ ቦታ ብቻ የሚፈልገው እና በርካታ ገፅታዎችን የያዘው፥ አዲሱ ፋየርፎክስ ይኸውልዎ።

source: Fast for good.
am: መፍጠን ነው ለበጎ ነገር።

source: File that bookmark
am: ዕልባቱን በአቃፊ ውስጥ ያስቀምጡ

source: Firefox, a different browser for different times. Browse free.
am: ፋየርፎክስ፦ የተለየ ድረ-ገፅ ማሰሻ በተለያዩ ጊዜዎች። በነፃ ያሰሱ።

source: Firefox Aurora automatically sends feedback to Mozilla.
am: ፋየርፎክስ አውሮራ በራስ ወደ ሞዚላ አስተያየት ይልካል

source: Firefox Beta automatically sends feedback to Mozilla.
am: ፋየርፎክስ ቤታ በራስ ወደ ሞዚላ አስተያየት ይልካል

source: Firefox Browser: Better bookmarks everywhere you go
am: ፋየርፎክስ ድረ-ገፅ ማሰሻ: ለሁሉም ድረ-ገፆች የተሻለ ዕልባት ያደርጋል

source: Firefox Browser: Fast, Easy Password Manager
am: ፋየርፎክስ ድረ-ገፅ ማሰሻ: ፈጣን፣ ቀላል የይለፍ ቃል መቆጣጠሪያ

source: Firefox Browser: Use less memory, get more speed
am: ፋየርፎክስ ድረ-ገፅ ማሰሻ: አነስተኛ የማህደረ ትውስታ ቦታ፣ ከፍተኛ ፍጥነት

source: Firefox Developer Edition automatically sends feedback to Mozilla.
am: ፋየርፎክስ የዴቬሎፐር እትም በራስ ወደ ሞዚላ አስተያየት ይልካል

source: Firefox is independent and a part of the non-profit Mozilla, which fights for your online rights, keeps corporate powers in check and makes the Internet accessible to everyone, everywhere.
am: ፋየርፎክስ ራሱን የቻለና ለትርፍ ያልተቋቋመ የሞዚላ አንዱ አካል ነው፤ ለኢንተርኔት መብትዎ የሚታገል፣ የግዙፍ ድርጅቶችን አቅም የሚቆጣጠር እና ኢንተርኔት በሁሉም ቦታ ለሁሉም ሰው ተደራሽ እንዲሆን ጠንክሮ የሚሠራ ድርጅት ነው።

source: Firefox is now faster and leaner
am: ፋየርፎክስ አሁን ፈጣን እና አነስተኛ ሆኗል

source: Firefox is offering something new to keep you safe: <a href="%(monitor)s">Firefox Monitor</a>. It’s a free service that will alert you if there are any public hacks on your accounts and let you know if your accounts got hacked in the past. Another neat feature is the Green Lock. It looks like a small green icon at the top left side of the browser window. If you’re on Firefox and see the green lock, it means the website is encrypted and secure. If the lock is grey, you might want to think twice about entering any sensitive information.
am: ፋየርፎክስ ደህንነትዎን ለመጠበቅ አዲስ ነገርም አቅርቧል: <a href="%(monitor)s">ፋየርፎክስ ሞኒተር</a>። በመለያዎት ላይ ማንኛውም የመረጃ መጠለፍ ካሉ የሚያሳውቅዎት እና መለያዎት ከዚህ በፊት ተጠልፎ እንደሆነ የሚያሳውቅዎት ነፃ አገልግሎት ነው፡፡ ሌላው ምርጥ ገጽታው ደግሞ አረንጓዴ ቁልፍ ነው። በድረ-ገፅ ማሰሻው መስኮት የላይኛው የግራ ክፍል ላይ ትንሽ አረንጓዴ ቁልፍ ይመስላል። ፋየርፎክስ ላይ ከሆኑ እና አረንጓዴውን ቆልፍ የሚያዩ ከሆነ ፤ ድረ-ገፁ የተመሰጠረ እና ደህንነቱ የተጠበቀ ነው ማለት ነው። መቆለፊያው ግራጫ ከሆነ፤ ማንኛውንም ሚስጥራዊነት ያለው መረጃ ስለማስገባት ከመወሰንዎ በፊት ሁለት ጊዜ ማሰብ ይኖርብዎታል።

source: Firefox is technology that fights for you.
am: ፋየርፎክስ ለእርስዎ ዘብ የሚቆም ዘመናዊ መሳሪያ ነው።

source: Firefox Nightly automatically sends feedback to Mozilla.
am: ፋየርፎክስ የማታ በራስ ወደ ሞዚላ አስተያየት ይልካል

source: Firefox Password Manager saves all your passwords in one place so you can automatically login to sites, or retrieve saved passwords.
am: ፋየርፎክስ የይለፍ ቃል መቆጣጠሪያ ሁሉንም የይለፍ ቃሎች ባንድ ቦታ ማስቀመጥ ስለሚችሉ በቀላሉ ወደተለያዩ ድረ-ገፆች በቀላሉ መግባት፣ ወይም የይለፍ ቃሉን በቀላሉ ማስታወስ ይችላሉ።

source: Firefox Privacy Notice
am: ሰለ ግላዊነት የፋየርፎክስ ማስታወቂያ

source: Firefox: Rebel with a cause
am: ፋየርፎክስ: በምክንያት ይቃወሙ

source: Firefox shows you how many data-collecting trackers are blocked with <strong>Enhanced Tracking Protection</strong>.
am: ፋየርፎክስ ምን ያህል ሰርጎ ገቦች እንደታገዱ <strong>የተሻሻለ ዱካ መከላከያ</strong> በመጠቀም በዝርዝር ያሳያል።

source: Firefox <span>browser</span>
am: ፋየርፎክስ <span>ድረ-ገፅ ማሰሻ</span>

source: Fly with that bookmark
am: ዕልባቱን ወደፈለጉት ቦታ ተንቀሳቃሽ ያድርጉት

source: Futz with that bookmark
am: ከዕልባቱ ጋር ትንሽ ጊዜ ያሳልፉ

source: Get a Firefox Account – Keep your data private, safe and synced
am: የFirefox መታወቂያ ያግኙ - መረጃዎችን ግላዊ፣ አስተማማኝ እና የተዛመዱ ያድርጉ

source: Get all the tabs without lags
am: ሁሉንም ትሮች ያለምንም መዘግየት ይጠቀሙ

source: Get a lookout for data breaches.
am: ከመረጃ መጭበርበር ይጠንቀቁ!

source: Get a sneak peek at the latest Firefox browser features before they’re released.
am: የቅርቡን ፋየርፎክስ ድረ-ገፅ ማሰሻ ዘመናዊ ገፅታዎች፤ በይፋ ከመለቁ በፊት በመጠኑ ይቃኙት።

source: Get into the open source spirit by test-driving upcoming products.
am: በቅርቡ ለሙከራ የሚለቀቁ ምርቶችን በመጠቀም በመርሀ-ግብሩ ላይ ይሳተፉ።

source: Get it all on every device, without feeling trapped in a single operating system.
am: በማንኛውም መገልገያ መሳሪያ ላይ፤ ምንም አይነት ስጋት ሳያድርብዎ ሁሉንም አገልግሎቶች በአንድ መተግበሪያ መሳሪያ ላይ ያግኙ።

source: Get more done. Browse faster and lighter with multiple tabs
am: የበለጠ ይሥሩ። በበርካታ ትሮች በፍጥነትና በቀላሉ የስሱ

source: Get technology that fights for you.
am: ለእርስዎ ዘብ የሚቆም ዘመናዊ መሳሪያ ያግኙ።

source: Get the Facebook Container Extension
am: የፌስቡክ መያዣ ቅጥያን ያግኙ

source: Get the knowledge to keep you safe.
am: ስለጥንቃቄ መንገዶች በቂ እውቀት ያግኙ።

source: Get the latest Firefox browser.
am: የቅርብ ጊዜውን ፋየርፎክስ ይጠቀሙ።

source: Get the respect you deserve.
am: ክብር ይገባዎታል!

source: Get your faves all sorted with the bookmark star icon, which lets you add custom names and folders quickly. Then dial in your bookmarks toolbar to make sure you never lose sight of the links you love.
am: የወደዳችሁትን ዕልባት የኮከብ ምልክት አርጋችሁበት፤ በፈለጋችሁት ስም እና አቃፊ ውስጥ በማስቀመጥ ስትፈልጉት ቶሎ ማግኘት ትችላላችሁ። ከዚያ የዕልባት ማውጫን በመጠቀም የምትወዱትን ድረ-ገፅ ምንም ሳያመልጣችሁ መከታተል ትችላላችሁ።

source: Give up the memory game with Firefox Password Manager.
am: ሁሉንም ነገር በማስታወስ መጨናነቅን ለፋየርፎክስ የይለፍ ቃል መቆጣጠሪያ ይተውት።

source: Help determine what features will go into the next Firefox for Android.
am: በቀጣዩ ፋየርፎክስ ለአንሮይድ ምን ባህሪያት እንዲጨመሩ ለመወሰን ያግዙ

source: Help us build a better Firefox for all.
am: የተሻለ የFirefox አገልግሎት ለሁሉም እንዲዳረስ ያግዙን።

source: Help us keep Big Tech in check.
am: ከፍተኛ የኢንፎርሜሽን ቴክኖሎጂን ለማረጋገጥ ያግዙን።

source: How to stop seeing too many ads and keep companies from following you around online. An ad blocker guide from the Firefox web browser.
am: እንዴት ነው ብዙ ማስታወቂያዎችን ከማየት ማስቆም እና ካምፓኒዎች በኢንተርኔት ላይ የእርስዎን ዱካ እንዳይከተሉ ማድረግ የሚችሉት። የማስታወቂያ ማገጃ መመሪያ ከፋየርፎክስ ድረ-ገፅ ማሰሻ ላይ ያንብቡ።

source: If your web browser uses too much memory, switch to Firefox.
am: የድረ-ገፅ ማሰሻዎት ብዙ ማህደረ ትውስታ ቦታን የሚጠቀም ከሆነ ወደ ፋየርፎክስ ይቀይሩት።

source: Install and contain
am: ያቀናጁና ይያዙት

source: Installing the <a href="%(fbcontainer)s">extension</a> is easy and, once activated, will open Facebook in a blue tab each time you use it. Use and enjoy Facebook normally. Facebook will still be able to send you advertising and recommendations on their site, but it will be much harder for Facebook to use your activity collected <strong>off Facebook</strong> to send you ads and other targeted messages.
am: አንዴ<a href="%(fbcontainer)s">ቅጥያ</a> ን ካቀናጁ እና ከሠራ፤ ፌስቡክን ስትከፍቱት ሁልጊዜ በሰማያዊ ትር ያስቀምጠዋል። ፌስቡክን ያለምንም ሀሳብ በመጠቀም ይደሰቱ። ፌስቡክ አሁንም በራሳቸው ድረ-ገፅ ላይ ማስታወቂያና መልዕክቶችን ሊልኩ ይችላሉ፤ ነገርግን <strong>ከፌስቡክ ውጭ</strong> የርስዎን ዱካ ለመከታተል፣ የታቀዱ ማስታወቂያዎችን እና መልዕክቶችን ለመላክ ያስቸግራቸዋል።

source: In the mid-nineties, Netscape, Internet Explorer and AOL dominated the landscape. It was a simpler time when the sweet melody of dial-up internet rang across the land. You learned the meaning of patience waiting for web pages to load. Back then, all that mattered was browser speed.
am: በአስራ ዘጠኛው ክ/ዘመን አጋማሽ ኔትስካፕ፣ ኢንተርኔት ኤክስፕሎረር እና አሜሪካን ኦንላይን በመላው ዓለም ዘርፉን ይመሩ ነበር። በወቅቱም ባጠቃላይ በምድሪቱ ላይ ተስፋፍቶ የነበረው ባለ-ገመድ የኢንተርኔት አገልግሎት ነበር። ታዲያ የሚፈልጉት ድረ-ገፅ እስከሚከፈት መጠበቅ ትዕግስትን ያስጨርስ ነበር። የዛን ጊዜ በጣም አስፈላጊው ነገር የኢንተርኔት ፍጥነት ብቻ ነበር።

source: Is your computer slow? Your browser might be using too much memory. Switch to Firefox today for more speed.
am: ኮምፒውተርዎ ቀርፋፋ ነው? የሚጠቀሙበት የድረ-ገፅ ማሰሻ ምናልባት ብዙ የማህደረ ትውስታ ቦታን ይይዝ ይሆናል። ለከፍተኛ ፍጥነት ዛሬውኑ ወደ ፋየርፎክስ ይለውጡት።

source: Join Firefox
am: ፋየርፎክስን ያግኙ

source: Keep your passwords protected and portable.
am: የይለፍ ቃልዎን ደህንነቱ የተጠበቀ እና ተንቀሳቃሽ ያድርጉ።

source: Language:
am: ቋንቋ:

source: Learn about Firefox browsers
am: ስለ ፋየርፎክስ ድረ-ገፅ ማሰሻ የበለጠ ይወቁ

source: Learn everything you need to know (but don’t yet) about staying smart and safe online, from some of the world’s foremost experts.
am: ማወቅ የሚገባዎትን ሁሉ ይማሩ(እስካሁን ካላወቁ) እንዴት ኢንተርኔትን በጥንቃቄ መጠቀም እንዳለብዎት፤ በመስኩ የላቀ እውቀት ካላቸው ምሁራን ይማሩ።

source: Learn more about Test Pilot
am: ስለ ሙከራ ፓይለት ተጨማሪ ይወቁ

source: Less memory usage than Chrome
am: ከክሮም አነስተኛ ማህደረ ትውስታን የሚጠቀም

source: Level-up browser gameplay
am: የድረ-ገፅ ማሰሻ ጨዋታን ደረጃ ከፍ ያድርጉ

source: Lightweight
am: ቀለል ያለ

source: Make your passwords portable
am: የይለፍ ቃልዎን ተንቀሳቃሽ ያድርጉት።

source: Marshall Erwin, Senior Director of Trust and Security at Mozilla
am: ማርሻል አርዊን፦ የሞዚላ የደህንነት ጥበቃ እና ዋስትና ክፍል ዋና ዳይሬክተር

source: Meet our family of privacy-first products.
am: ከግላዊ-የመጀመሪያ ምርቶች ቤተሰባችንን ያግኙ።

source: Millions of people around the world trust Firefox Web browsers on Android, iOS and desktop computers. Fast. Private. Download now!
am: በሚሊዮን የሚቆጠሩ ሠዎች ፋየርፎክስ ድረ-ገፅ ማሰሻን በአንድሮይድ፣ iOS እና በዴስክቶፕ ኮምፒውተር ላይ በሙሉ እምነት ይጠቀማሉ። ፈጣን እና ግላዊ። አሁኑኑ ይጫኑ!

source: Multi-tasking with multiple tabs just got easier. Firefox is now a multi-process browser, which means that your tabs stay fresh and won’t take forever to reload. With 86% less hang time, switch quickly between tabs even as you open more.
am: ብዙ ሥራዎች ከብዙ ትሮች ጋር ማከናወን ተችሏል። አሁን ፋየርፎክስ ብዙ የሚያከናውን ማሰሻ ሆኗል፤ ይኼም ማለት ትሮች ንቁ እንደሆኑ ይቆያሉ ስለዚህ በየጊዜው መጫን አያስፈልግም። ብዙ ትሮች ቢከፍቱም እንኳን፤ 86% የቆይታ ጊዜ እና ከአንዱ ትር ወደሌላው በፍጥነት መሸጋገር ያስችልዎታል።

source: Nightly Blog
am: የማታ ብሎግ

source: No one likes a computer hog! Firefox is a lean, mean (actually we’re pretty nice) browsing machine. Since we use less RAM than Chrome, your other programs can keep running at top speed.
am: ማንም ኮምፒውተሩን የሚያጨናንቅበትን ነገር አይፈልግም! ፋየርፎክስ አነስተኛ ቦታን የሚፈልግ፤ የማያጨናንቅ (በርግጥ ግሩም ነው) የማሰሻ መሳሪያ ነው። ከክሮም በተሻለ አነስተኛ RAM ስለምንጠቀም፤ ሌሎች ፕሮግራሞች በከፍተኛ ፍጥነት መሥራታቸውን ይቀጥላሉ።

source: No strings attached
am: ያለምንም ገደብና ቅድመ ሁኔታ

source: One easy way to check is to visit a browser’s content setting page and privacy policy. The privacy webpage should outline if your data is shared and why. It’s why the <a href="%(privacy)s">Firefox privacy notice</a> is easy to read and easy to find.
am: ይኼንን ለማረጋገጥ የድረ-ገፁን የማቀናበሪያና የግላዊነት ፖሊሲ ይዘት ማየት አለብን። ይኽ የግላዊነት ፖሊሲ ታዲያ የርስዎን መረጃ ለሌሎች የሚያጋራ መሆኑን እና ለምን እንደሚያጋራ መግለፅ አለበት። ለዚህ ነው <a href="%(privacy)s">ፋየርፎክስ የግላዊነት ማስታወቂያ</a> በቀላሉ የሚገኝና የሚረዱት የተደረገው።

source: One of the most popular ad blockers for Chrome, Safari and Firefox is <a href="%(url)s">AdBlock</a>. Use it to block ads on Facebook, YouTube and Hulu.
am: ለ Chrome ፣ Safari እና Firefox በጣም ታዋቂ የማስታወቂያ አጋጆች አንዱ ‹a href="%(url)s"> AdBlock </a> ነው። በ Facebook ፣ YouTube እና Hulu ላይ ማስታወቂያዎችን ለማገድ ይጠቀሙበት።

source: Opt out on your terms
am: በራስዎ ደንቦች ይመሩ

source: Our new, powerful multi-process platform handles all your tabs without slowing down your computer.
am: አዲሱ የእኛ ሥርዓተ-ውቅር፤ ከፍተኛ አቅም ያለውና ብዙ ሥራዎችን ማከናወን የሚችል ሲሆን፤ የኮምፒውተርዎ ፍጥነት ሳይቀንስ ሁሉንም ትሮች መያዝ ይችላል።

source: Password hero
am: የይለፍ ቃል ጀግና

source: Password Manager achievement unlocked
am: የይለፍ ቃል መቆጣጠሪያ በተሳካ ሁኔታ ተከፍቷል

source: Passwords made portable
am: የይለፍ-ቃሎች ተንቀሳቃሽ ሆነዋል

source: Platform:
am: የአወቃቀር ስርአት:
